[{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51BDwxJhz%2BL.jpg","notes":"1000 of the best record covers of all time from the \"\"Michael Ochs Archives,\"\" one of the world's largest private collections.","title":"1000 Record Covers","type":"Book","uuidString":"D9A64710-0367-423C-9E47-CC8A69E651AD"},{"associatedURL":"http://amzn.to/2EXMQMT","coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51RpT7%2Bu%2BqL.jpg","notes":"In A Brief History of Seven Killings, Marlon James combines masterful storytelling with his unrivaled skill at characterization and his meticulous eye for detail to forge a novel of dazzling ambition and scope.  On December 3, 1976, just before the Jamaican general election and two days before Bob Marley was to play the Smile Jamaica Concert to ease political tensions in Kingston, seven unnamed gunmen stormed the singer’s house, machine guns blazing. The attack wounded Marley, his wife, and his manager, and injured several others. Little was officially released about the gunmen, but rumors abounded regarding the assassins’ fates. A Brief History of Seven Killings is James’s fictional exploration of that dangerous and unstable time in Jamaica’s history and beyond. Deftly spanning decades and continents and peopled with a wide range of characters—assassins, drug dealers, journalists, and even ghosts—James brings to life the people who walked the streets of 1970s Kingston, who dominated the crack houses of 1980s New York, and who reemerged into a radically altered Jamaica of the 1990s. Brilliantly inventive, A Brief History of Seven Killings is an “exhilarating” (The New York Times) epic that’s been called “a tour de force” (The Wall Street Journal).","title":"A Brief History of Seven Killings: A Novel","type":"Book","uuidString":"55AEE08A-CB0E-4B62-B5C2-8F7439280A70"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/5192eGJ97nL.jpg","notes":"This novel of the English in India Ranks amount the great literary works of the twentieth century","title":"A Passage to India","type":"Book","uuidString":"94C85B2A-ECF7-40EE-86B3-03986D8BFAB9"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51N%2BwL5GA2L.jpg","notes":"Patricia Williams is a lawyer and a professor of commercial law, the great-great-granddaughter of a slave and a white southern lawyer. The Alchemy of Race and Rights is an eloquent autobiographical essay in which the author reflects on the intersection of race, gender, and class. Using the tools of critical literary and legal theory, she sets out her views of contemporary popular culture and current events, from Howard Beach to homelessness, from Tawana Brawley to the law-school classrom, from civil rights to Oprah Winfrey, from Bernhard Goetz to Marth Beth Whitehead. She also traces the workings of \"ordinary racism\"--everyday occurrences, casual, unintended, banal perhaps, but mortifying. Taking up the metaphor of alchemy, Williams casts the law as a mythological text in which the powers of commerce and the Constitution, wealth and poverty, sanity and insanity, wage war across complex and overlapping boundaries of discourse. In deliberately transgressing such boundaries, she pursues a path toward racial justice that is, ultimately, transformative. Williams gets to the roots of racism not by fingerpointing but by much gentler methods. Her book is full of anecdote and witness, vivid characters known and observed, trenchant analysis of the law's shortcomings. Only by such an inquiry and such patient phenomenology can we understand racism. The book is deeply moving and not so, finally, just because racism is wrong--we all know that. What we don't know is how to unthink the process that allows racism to persist. This Williams enables us to see. The result is a testament of considerable beauty, a triumph of moral tactfulness. The result, as the title suggests, is magic.","title":"Alchemy of Race and Rights:  Diary of a Law Professor","type":"Book","uuidString":"9B101523-3A50-447C-80BB-7338C74B544C"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51MRjkqNj6L.jpg","notes":"A little girl follows a remarkable rabbit down a rabbit hole and steps through a looking-glass to come face to face with some of the strangest adventures and some of the oddest characters in all literature. The crusty Duchess, the Mad Hatter, the weeping Mock Turtle, the diabolical Queen of Hearts, the Cheshire-Cat, Tweedledum and Tweedledee--each one is more eccentric, and more entertaining, than the last.","title":"Alice's Adventures in Wonderland &amp; Through the Looking-Glass","type":"Book","uuidString":"E11E2809-D86A-48A3-95D4-6D32DB700CB6"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51iqnnHiHuL.jpg","notes":"Describes the experiences of American authors, musicians, artists, politicians, and celebrities in the neighborhoods and historic buildings of Paris","title":"Americans in Paris: an Anecdotal Street Guide","type":"Book","uuidString":"632404C1-B5DF-4688-8B39-69A43E1678AA"},{"coverImageLargeURLString":"https://www.google.com/url?sa=i&amp;rct=j&amp;q=&amp;esrc=s&amp;source=images&amp;cd=&amp;ved=0ahUKEwiup5aGv-vUAhVGej4KHYF-DB0QjRwIBw&amp;url=https%3A%2F%2Fwww.amazon.com%2Fwalls-came-tumbling-down-autobiography%2Fdp%2FB007FSUJII&amp;psig=AFQjCNHm8h7XlARyIJXZm1ojsrzU7fDAkA&amp;ust=1499115625649117","notes":"A leader of the civil rights movement and an intimate friend of Martin Luther King, Jr., describes his own life, the murder of King, and his continuing struggle for freedom, dignity, and human rights","title":"And the Walls Came Tumbling Down: An Autobiography","type":"Book","uuidString":"EA7B3F5C-C307-4FC9-99B9-9488B875890A"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/513gHL2F1SL.jpg","notes":"A Finalist for the 2016 National Book Award  New York Times Bestseller  A SeattleTimes pick for Summer Reading Roundup 2017  The acclaimed New York Times bestselling and National Book Award–winning author of Brown Girl Dreaming delivers her first adult novel in twenty years.  Running into a long-ago friend sets memory from the 1970s in motion for August, transporting her to a time and a place where friendship was everything—until it wasn’t. For August and her girls, sharing confidences as they ambled through neighborhood streets, Brooklyn was a place where they believed that they were beautiful, talented, brilliant—a part of a future that belonged to them.  But beneath the hopeful veneer, there was another Brooklyn, a dangerous place where grown men reached for innocent girls in dark hallways, where ghosts haunted the night, where mothers disappeared. A world where madness was just a sunset away and fathers found hope in religion.  Like Louise Meriwether’s Daddy Was a Number Runner and Dorothy Allison’s Bastard Out of Carolina, Jacqueline Woodson’s Another Brooklyn heartbreakingly illuminates the formative time when childhood gives way to adulthood—the promise and peril of growing up—and exquisitely renders a powerful, indelible, and fleeting friendship that united four young lives.","title":"Another Brooklyn: A Novel","type":"Book","uuidString":"F6C19DDF-2A76-4B26-833A-EDC022DF3167"},{"coverImageLargeURLString":"https://www.google.com/url?sa=i&amp;rct=j&amp;q=&amp;esrc=s&amp;source=images&amp;cd=&amp;ved=0ahUKEwiA_PiqqOvUAhVGaD4KHTttBdUQjRwIBw&amp;url=https%3A%2F%2Fwww.amazon.com%2FApartheid-History-Brian-Lapping%2Fdp%2F0246130644&amp;psig=AFQjCNENLAnn6JogIGcoE2RV_P9eDmlmaQ&amp;ust=1499109523155370","notes":"A history of apartheid traces the institution back to its roots in the 17th century, and shows how it developed along with Afrikaner nationalism, as well as the response from the Africans","title":"Apartheid: A History","type":"Book","uuidString":"5A6D02BB-B8FE-4E7C-8FF7-4ED45F3A1CF5"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/514k-7-bXhL.jpg","notes":"\"This is one of those rare books that quickly became the standard work in its field. Professor White has done justice to the complexity of her subject.\"―Anne Firor Scott, Duke University  Living with the dual burdens of racism and sexism, slave women in the plantation South assumed roles within the family and community that contrasted sharply with traditional female roles in the larger American society. This new edition of Ar'n't I a Woman? reviews and updates the scholarship on slave women and the slave family, exploring new ways of understanding the intersection of race and gender and comparing the myths that stereotyped female slaves with the realities of their lives. Above all, this groundbreaking study shows us how black women experienced freedom in the Reconstruction South ― their heroic struggle to gain their rights, hold their families together, resist economic and sexual oppression, and maintain their sense of womanhood against all odds.","title":"Ar'n't I a Woman?: Female Slaves in the Plantation South","type":"Book","uuidString":"E63FF308-1EE8-48CC-ACE9-08B1C18AE4CD"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/71M9TEE9BZL.gif","notes":"A blow-by-blow re-creation of the battle royal that raged in Congress in the 1830s, when a small band of representatives, led by President John Quincy Adams of Massachusetts, employed intricate stratagems to outwit the Southern (and Southern-sympathizing) sponsors of the successive \"gag\" rules that had long blocked debate on the subject of slavery.","title":"Arguing about Slavery: The Great Battle in the United States Congress","type":"Book","uuidString":"34DD4BC9-CC5A-4230-BDB1-7A17298C78AC"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/61A7NEWmPEL.jpg","notes":"This is the biggest selling, most read edition of this 5000 year old classic of world literature. Prabhupada's Gita is also by far the most translated edition of this Sanskrit original. The Bhagavad-Gita is the main source-book on yoga and a concise summary of India's Vedic wisdom. The setting is the ancient battlefield of Kurukshetra, in Northern India. At the last moment before entering a massive battle with almost a million soldiers, the great warrior Arjuna begins to wonder about the real meaning of his life. Why should he fight against his friends and relatives? Why does he exist? Where is he going after death? In the Bhagavad-Gita, Lord Krsna, Arjuna's friend and spiritual master, brings His disciple from perplexity to spiritual enlightenment. In the course of doing so, Krsna concisely but definitively explains transcendental knowledge; karma-yoga, jnana-yoga, dhyana-yoga, and bhakti-yoga; knowledge of the Absolute; devotional service; the three modes of material nature; the divine and demoniac natures of man, and all the other questions we would all want to ask, and many more we would think of.","title":"Bhagavad Gita as it is","type":"Book","uuidString":"3D7F30AB-D96F-4EBB-8638-2A69D5B5558C"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/41yvKV5YOkL.jpg","notes":"Black Elk Speaks is the story of the Lakota visionary and healer Nicholas Black Elk (1863-1950) and his people during the momentous twilight years of the nineteenth century. Black Elk met the distinguished poet, writer, and critic John G. Neihardt (1881-1973) in 1930 on the Pine Ridge Reservation in South Dakota and chose Neihardt to tell his story. Neihardt understood and conveyed Black Elk’s experiences in this powerful and inspirational message for all humankind. When Black Elk received his great vision, white settlers were invading the Lakotas’ homeland, decimating buffalo herds, and threatening to extinguish the Lakotas’ way of life. The Lakotas fought fiercely to retain their freedom and way of life, a dogged resistance that resulted in a remarkable victory at the Little Bighorn and an unspeakable tragedy at Wounded Knee. Black Elk Speaks offers much more than a precious glimpse of a vanished time, however. As related by Neihardt, Black Elk’s searing visions of the unity of humanity and the earth have made this book a venerated spiritual classic. Whether appreciated as the poignant tale of a Lakota life, a history of a Native nation, or an enduring spiritual testament, Black Elk Speaks is unforgettable.     This new edition features two additional essays by John G. Neihardt that further illuminate his experience with Black Elk; an essay by Alexis Petri, great-granddaughter of John G. Neihardt, that celebrates Neihardt’s remarkable accomplishments; and a look at the legacy of the special relationship between Neihardt and Black Elk, written by Lori Utecht, editor of Knowledge and Opinion: Essays and Literary Criticism of John G. Neihardt.  For more information on John G. Neihardt, visit www.neihardt.com","title":"Black Elk Speaks: Being the Life Story of a Holy Man of the Oglala Sioux","type":"Book","uuidString":"2D8B6344-E8BE-413C-902D-92604E23DE83"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/710CM90DH6L.gif","notes":"A large part of Goines' thirty nine years of life was spent being a successful pimp, a heif, an operator of corn liquor houses, an armed robber, and a small time dope dealer. He lived the life of the streets and out of that experience he created Prince, the anti-hero of Black Gangster! It's the story of the shocking underworld of black organised crime and the fledgling black \"godfather\" who goes from teenager ganglord to powerful Detroit mobster. Like the gangsters of the 1920's, he begins with boot-legging and branches out into every known crime","title":"Black Gangster","type":"Book","uuidString":"4D200EFE-47F8-411E-9D0F-D361A86DF72C"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/41C6B0GDNHL.jpg","notes":"From its beginnings in hip hop culture, the dense rhythms and aggressive lyrics of rap music have made it a provocative fixture on the American cultural landscape. In Black Noise: Rap Music and Black Culture in Contemporary America, Tricia Rose, described by the New York Times as a \"hip hop theorist,\" takes a comprehensive look at the lyrics, music, cultures, themes, and styles of this highly rhythmic, rhymed storytelling and grapples with the most salient issues and debates that surround it. ","title":"Black Noise: Rap Music and Black Culture in Contemporary America","type":"Book","uuidString":"F3E53E90-8866-44E4-B529-C96996D1DD82"},{"associatedURL":"http://amzn.to/2F0hkOk","coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/61R8Z26QW5L.jpg","notes":"Crowned the king of Afrobeat and dubbed the Black President, Fela Anikulapo-Kuti was a master performer, composer and voice of the oppressed. The Nigerian musician and activist invented an infectious new musical genre called Afrobeat, combining American funk and jazz with traditional Yoruba and highlife music to end up with a sound that doubled as a weapon for justice. Troubled by the state of Nigerian society, he assembled and built his Kalakuta Republic and created his own political party, actions which saw him arrested, imprisoned and beaten by the police and military--but Fela was so influential in Nigerian cultural and political life that even they flocked to his funeral to pay respect to their fallen hero. This book features a diverse range of artists who continue to be inspired by Fela's artistic genius and dedication to justice and equality: from visual practitioners like Sanford Biggers, Barkley L. Hendricks, Alfredo Jaar, Wangechi Mutu, Odili Odita, Olu Oguibe, Senam Okudzeto, Yinka Shonibare, Kara Walker and Fred Wilson to musicians, rappers and DJs. Accompanying essays consider Fela's influence on his musical contemporaries and on an international array of visual artists, Fela as African Blaxploitation hero, and Fela's music in the context of the Nigerian political situation and contemporary activist art. Also included are an updated version of a seminal 1980s article on Fela, a fiction-driven story that reconstructs the last six months of Fela's life, and a poem that deals with Fela's influence on the poet's conception of Africa. Edited by Trevor Schoonmaker.~Essays by Trevor Schoonmaker, Yomi Durotoye, Vivien Goldman, Olu Oguibe, Moyo Okediji and Michael E. Veal. ~Creative writing by Biyi Bandele and Sharon Strange.","title":"Black President: The Art and Legacy of Fela Anikulapo-Kuti","type":"Book","uuidString":"F3BC48B0-29EC-42F0-9B5B-89154F0A4EBE"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51jcu4spniL.jpg","notes":"Tayo, a young Native American, has been a prisoner of the Japanese during World War II, and the horrors of captivity have almost eroded his will to survive. His return to the Laguna Pueblo reservation only increases his feeling of estrangement and alienation. While other returning soldiers find easy refuge in alcohol and senseless violence, Tayo searches for another kind of comfort and resolution. ","title":"By Leslie Marmon Silko - Ceremony","type":"Book","uuidString":"9EEEB556-A2EF-4BC1-ACD1-9C99EC4E1014"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/516VbhOdm1L.jpg","notes":"By turns touching and hilarious, Coming of Age in America gathers together writers from fifteen different ethnic groups who, through their fiction, explore the terrain we all traverse as we come of age, no matter our race, ethnicity, gender, or class. ","title":"Coming of Age in America: A Multicultural Anthology","type":"Book","uuidString":"CA6F3C1F-37F8-4973-B6A1-1747162F57E4"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51GX8K2P6ZL.jpg","notes":"Goines' powerful first novel lays bare the bloody, brutal world of crime in the black ghetto, where, as Goines put it, \"kindness was the sweetest con of all.\" Here is the gusty and often shocking world of Billy and Jackie, prison buddies on the streets and hot n the trigger.","title":"Crime Partners","type":"Book","uuidString":"C247A147-396B-4A30-AE9E-478608B3E80E"},{"coverImageLargeURLString":"https://www.google.com/url?sa=i&amp;rct=j&amp;q=&amp;esrc=s&amp;source=images&amp;cd=&amp;ved=0ahUKEwjGisX8p-vUAhXKdD4KHVdCAsUQjRwIBw&amp;url=https%3A%2F%2Fwww.amazon.com%2FCry-Revenge-Donald-Goines%2Fdp%2F0870679872&amp;psig=AFQjCNHQgXWztMcvCvlzqCjSn6eswtWgSg&amp;ust=1499109433675161","notes":"Young Curtis Carson doesn't mean to rip off the Chicanos on his backyard crap games. He just rolls the dice better. But Chicanos don't see it that way, and when one of their brothers is brutally slaughtered in a barroom shootout because of Curtis' dealings with heroin pusher Fat George, the Mexicans cry revenge on Curtis, leaving his brother with a wrecked body that will forever prevent him form being the basketball star he'd always dreamed of being. Curtis swears vengeance, and the streets run red with black-Chicano warfare!","title":"Cry Revenge","type":"Book","uuidString":"915BB0D1-E8BF-429C-BB7C-1791CCDED996"},{"coverImageLargeURLString":"https://www.google.com/url?sa=i&amp;rct=j&amp;q=&amp;esrc=s&amp;source=images&amp;cd=&amp;ved=0ahUKEwiq5KWGqOvUAhXD7D4KHR0IAsEQjRwIBw&amp;url=http%3A%2F%2Fwww.goodreads.com%2Fbook%2Fshow%2F957009.Daddy_Cool&amp;psig=AFQjCNGByMQeH9dxCuaFGoqJ8CeaTF8JKA&amp;ust=1499109453455582","notes":"To his clients, Larry Jackson is known as \"Daddy Cool.\" Nobody's better at what he does. Nothing knocks him off his game. With ice in his veins, he'll pull the trigger or stick a knife deep. All that matters is he gets paid—and that his teenage daughter, Janet, stays clear of the streets. But when Janet is lured into the stable of a young, smooth-talking pimp, Daddy Cool sees red—and goes into action deadly cold and unstoppable. . . ","title":"Daddy Cool","type":"Book","uuidString":"EC1B32FA-9697-4669-B979-9F1741D22B26"},{"associatedURL":"http://amzn.to/2DpuJPL","coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/41gt60AkCoL.jpg","notes":"In this powerful sequence of TV images and essay, Claudia Rankine explores the personal and political unrest of our volatile new century  I forget things too. It makes me sad. Or it makes me the saddest. The sadness is not really about George W. or our American optimism; the sadness lives in the recognition that a life can not matter.  The award-winning poet Claudia Rankine, well known for her experimental multigenre writing, fuses the lyric, the essay, and the visual in this politically and morally fierce examination of solitude in the rapacious and media-driven assault on selfhood that is contemporary America. With wit and intelligence, Rankine strives toward an unprecedented clarity-of thought, imagination, and sentence-making-while arguing that recognition of others is the only salvation for ourselves, our art, and our government.  Don't Let Me Be Lonely is an important new confrontation with our culture, with a voice at its heart bewildered by its inadequacy in the face of race riots, terrorist attacks, medicated depression, and the antagonism of the television that won't leave us alone.","title":"Don't Let Me Be Lonely: An American Lyric","type":"Book","uuidString":"73BA347D-95A7-42E5-8BA0-0225F05E8A54"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/212H730ZG9L.jpg","notes":"For twenty-three years of his life Donald Goinse lived in the dark, despair-ridden world of the junkie. It started while he was doing military service in Korea and ended with his murder at the age of thirty nine. He had worked up to a hundred dollars a day habit and out of the agonizing hell came Dopefiend! It is the shocking nightmare story of a black heroin addict. Trapped in the festering sore of a major American ghetto, a young man and his girlfriend- both handsome, talented, and full of promise- are inexorably pulled into death of the hardcore junkie!","title":"Dopefiend","type":"Book","uuidString":"344585E8-DC0F-4620-95DD-FEAFC421A0DD"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/41em-HwZj5L.jpg","notes":"Good writing is brief and clear. This new edition of the popular handbook offers updated, practical advice on writing effective letters, reports, and memos, while retaining the easy-to-read format that made the first edition so popular. Presents examples of good writing to serve as models and also shows what to avoid. Includes illustrations (many more than in the 1st edition) of many types of good writing, culled from diverse sources. There is new material on writing minutes, news releases, resumes, and style guides. The section on writing reports has been thoroughly revised--every phase from initial organization to final selection of style has been updated to reflect modern practice. Suitable for classroom use or self-study.","title":"Effective Writing for Engineers, Managers, Scientists by Tichy, H. J. (1966) Hardcover","type":"Book","uuidString":"43378B51-1BF8-4839-988E-E418B2BBFC6B"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/513%2BUIBtPoL.jpg","notes":"Twelve stories explore the borders between black and white America as they are crossed and known by students and Peace Corps volunteers of the 1960s, failed preachers, young punks, jealous lovers, and others","title":"Elbow Room: Stories","type":"Book","uuidString":"FA0004BF-9E36-44A4-A94A-9D7A3054BD54"},{"notes":"Eyes on the Prize traces the movement from the landmark Brown v. the Board of Education case in 1954 to the march on Selma and the passage of the Voting Rights Act in 1965. This is a companion volume to the first part of the acclaimed PBS series.","title":"Eyes on the Prize","type":"Book","uuidString":"235EA973-CC49-4CAD-A5F9-891AEB362283"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51FAawr8LiL.jpg","notes":"One of a series about the antebellum plantation Falconhurst and its ruthless masters, the Maxwells. Series was written out of chronological order. ","title":"Falconhurst Fancy by Kyle Onstott (Author) Lance Horner (Author) (1966-05-03)","type":"Book","uuidString":"5EF61190-A250-42C5-BA35-2F23C05B3F42"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/415y-E%2BAXvL.jpg","notes":"Working mothers, broken homes, poverty, racial or ethnic background, poorly educated parents—these are the usual reasons given for the academic problems of poor urban children. Reginald M. Clark contends, however, that such structural characteristics of families neither predict nor explain the wide variation in academic achievement among children. He emphasizes instead the total family life, stating that the most important indicators of academic potential are embedded in family culture.  To support his contentions, Clark offers ten intimate portraits of Black families in Chicago. Visiting the homes of poor one- and two-parent families of high and low achievers, Clark made detailed observations on the quality of home life, noting how family habits and interactions affect school success and what characteristics of family life provide children with \"school survival skills,\" a complex of behaviors, attitudes, and knowledge that are the essential elements in academic success.  Clark's conclusions lead to exciting implications for educational policy. If school achievement is not dependent on family structure or income, parents can learn to inculcate school survival skills in their children. Clark offers specific suggestions and strategies for use by teachers, parents, school administrators, and social service policy makers, but his work will also find an audience in urban anthropology, family studies, and Black studies.","title":"Family Life and School Achievement: Why Poor Black Children Succeed or Fail","type":"Book","uuidString":"80A55897-54A2-466E-AF75-65DB58684593"},{"associatedURL":"https://www.amazon.com/gp/product/1556528353/ref=as_li_tl?ie=UTF8&amp;tag=themarksmen-20&amp;camp=1789&amp;creative=9325&amp;linkCode=as2&amp;creativeASIN=1556528353&amp;linkId=cac3864c065a88b820183ed129e467b2","coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51NTXWj2n3L.jpg","notes":"African superstar, composer, singer, and musician, as well as mystic and political activist, Nigerian Fela Kuti, born in 1938, was controversy personified. He was swept to international celebrity on a wave of scandal and flamboyance, and when he died of AIDS in 1997, more than a million people attended his funeral. But what was he really like, this man who could as easily arouse violent hostility as he could unswerving loyalty?   Carlos Moore's unique biography, based on hours of conversation and told in Fela's first-person vernacular, reveals the icon's complex personality and tumultuous existence. Moore includes interviews with fifteen of his queens (wives); photos; and an updated discography.","title":"Fela: This Bitch of a Life","type":"Book","uuidString":"8D6139D7-556A-4F70-B797-EA31179FACEA"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/41j2yeThscL.jpg","notes":"Henry Louis Gates, Jr. presents the only authoritative edition of all three autobiographies by the escaped slave who became a great American leader.  Born a slave, Frederick Douglass educated himself, escaped, and made himself one of the greatest leaders in American history. Here in this Library of America volume are collected his three autobiographical narratives, now recognized as classics of both American history and American literature. Writing with the eloquence and fierce intelligence that made him a brilliantly effective spokesman for the abolition of slavery and equal rights, Douglass shapes an inspiring vision of self-realization in the face of monumental odds.","title":"Frederick Douglass : Autobiographies : Narrative of the Life of Frederick Douglass, an American Slave / My Bondage and My Freedom / Life and Times of Frederick Douglass","type":"Book","uuidString":"65BC5861-86BF-48C1-A4AB-950A27B30DCF"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51XNAF9XWFL.jpg","notes":"Probably the most delightful, useful, and comprehensive elementary book available for learning spoken and written French, either with or without a teacher. Working on the principle that a person learns more quickly by example then by rule, Lemaître has assembled colloquial French conversations on a variety of subjects, as well as grammar, vocabulary, and idiom studies","title":"French: How to Speak and Write It","type":"Book","uuidString":"D07F7C27-1A44-4337-BA29-1B5E57CEB8F8"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/4143zWojXKL.jpg","notes":"Black American Writers in France, 1840-1980; 'The list of individuals profiled in this thoughtful, eye-opening study is a veritable who's who of black America literature...By discussing the effects of both world wars and the ideologies of the Harlem Renaissance, the French Negritude movement, and Black Power in Paris, Fabre enriches our understanding of black history, culture, and art on both sides of the Atlantic.'","title":"From Harlem to Paris: Black American Writers in France, 1840-1980","type":"Book","uuidString":"92E114AD-934F-448F-AB5D-B11A01BA4DF3"},{"associatedURL":"http://amzn.to/2BiWYNQ","coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/414-8IslOiL.jpg","notes":"In the New York Times bestseller From Pieces to Weight, rap mogul 50 Cent, lifts the veil on his complicated life, from the murder of his mother when he was twelve, to hustling on the streets; from the assassination attempt that nearly finished him to his meteoric rise to the top of hip hop royalty.  This violent and introspective memoir reveals not only 50 Cent's story but also the story of a generation of youth faced with hard choices and very few options. It is a tale of sacrifice, transformation, and redemption, but also one of hope, determination, and the power of self. Told in 50's unique voice, the narrative drips with the raw insight, street wisdom, and his struggle to survive at all costs -- and behold the riches of the American Dream.","title":"From Pieces to Weight: Once Upon a Time in Southside Queens","type":"Book","uuidString":"AEB8BDE2-498B-48AD-9255-C6968F8615D2"},{"associatedURL":"http://amzn.to/2Dn9pKs","coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/41QiK9dojVL.jpg","notes":"A native of Haiti, Dimitry Elias Léger makes his remarkable debut with this story of romance, politics, and religion that traces the fates of three lovers in Port-au-Prince, Haiti, and the challenges they face readjusting to life after an earthquake devastates their city.  Reflecting the chaos of disaster and its aftermath, God Loves Haiti switches between time periods and locations, yet always moves closer to solving the driving mystery at its center: Will the artist Natasha Robert reunite with her one true love, the injured Alain Destiné, and live happily ever after? Warm and constantly surprising, told in the incandescent style of José Saramago and Roberto Bolaño, and reminiscent of Gabriel García Márquez’s hauntingly beautiful Love in The Time of Cholera, God Loves Haiti is an homage to a lost time and city, and the people who embody it.","title":"God Loves Haiti: A Novel","type":"Book","uuidString":"50A2D468-EB28-49C3-B9E9-71D92479AB28"},{"associatedURL":"http://amzn.to/2DpBkcD","coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51JYP85S0DL.jpg","notes":"As a former editor-in-chief of hip-hop magazine the Source and a fan since he was a nine-year-old living in Guyana, Hinds knows hip-hop as well as any journalist around. This account is part memoir, part behind the music: we get days in the life of Puffy, Lauryn Hill at the Grammys and guerrilla touring with the Wu-Tangs. We get Hinds's writerly woodshedding at Princeton and the Village Voice, the rise of the Source, sweaty clubs in Brooklyn and the escalation of the East Coast-West Coast feud until two of rap's superstars, Tupac and Biggie Smalls, are lost. An excellent storyteller, Hinds can write with equal intensity about his little brother's aspiration to be an MC, hiring an intern to go through \"the Wack Box\" or hurtling down the highway with Raekwon and Ghostface. Even though he knows it's business, Hinds's book works because he still believes in the power of this new, brash and still-not-fully charted art: this is a fan's memoir first, and a journalist's chronicle second.","title":"Gunshots in My Cook-Up: Bits and Bites from a Hip-Hop Caribbean Life","type":"Book","uuidString":"68C5AF48-656A-437C-8824-59E46385147F"},{"associatedURL":"http://amzn.to/2DWfTRw","coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51MjgPinCfL.jpg","notes":"The catalogue prepared for the Metropolitan Museum of Art exhibit \"Harlem on My Mind.\"","title":"Harlem On My Mind - Cultural Capital Of Black America, 1900-1968","type":"Book","uuidString":"AD0EF976-6DCD-4765-9C12-C022C89C7A07"},{"associatedURL":"http://amzn.to/2DYp0S5","coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51Qagso6-mL.jpg","notes":"Jacob Riis was one of the very few men who photographed the slums of New York at the turn of the twentieth century, when as many as 300,000 people per square mile were crowded into the tenements of New York's Lower East Side. The filth and degradation made the area a hell for the immigrants forced to live there. Riis was one of those immigrants, and, after years of abject poverty, when he became a police reporter for the New York Tribune, he exposed the shameful conditions of life with which he was all too familiar. Today, he is best remembered as a compassionate and effective reformer and as a pioneer photo-journalist. ","title":"How the Other Half Lives: Studies Among the Tenements of New York","type":"Book","uuidString":"DAA19443-C1F0-4C62-8BD4-5BA5954E6E45"},{"associatedURL":"http://amzn.to/2DUfZJu","coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51B9Uxf3zqL.jpg","notes":"A MEMOIR BY THE YOUNGEST RECIPIENT OF THE NOBEL PEACE PRIZE   \"I come from a country that was created at midnight. When I almost died it was just after midday.\"  When the Taliban took control of the Swat Valley in Pakistan, one girl spoke out. Malala Yousafzai refused to be silenced and fought for her right to an education.  On Tuesday, October 9, 2012, when she was fifteen, she almost paid the ultimate price. She was shot in the head at point-blank range while riding the bus home from school, and few expected her to survive.  Instead, Malala's miraculous recovery has taken her on an extraordinary journey from a remote valley in northern Pakistan to the halls of the United Nations in New York. At sixteen, she became a global symbol of peaceful protest and the youngest nominee ever for the Nobel Peace Prize.  I AM MALALA is the remarkable tale of a family uprooted by global terrorism, of the fight for girls' education, of a father who, himself a school owner, championed and encouraged his daughter to write and attend school, and of brave parents who have a fierce love for their daughter in a society that prizes sons.  I AM MALALA will make you believe in the power of one person's voice to inspire change in the world.","title":"I Am Malala: The Girl Who Stood Up for Education and Was Shot by the Taliban","type":"Book","uuidString":"81D2B51F-BC7A-4A13-B05B-EDAC27AC4D18"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51UyZBFigxL.jpg","notes":"The beating of Rodney King and the resulting riots in South Central Los Angeles. The violent clash between Hasidim and African-Americans in Crown Heights. The boats of Haitian refugees being turned away from the Land of Opportunity. These are among the many racially-charged images that have burst across our television screens in the last year alone, images that show that for all our complacent beliefs in a melting-pot society, race is as much of a problem as ever in America. In this vastly important, widely-acclaimed volume, Kwame Anthony Appiah, a Ghanaian philosopher who now teaches at Harvard, explores, in his words, \"the possibilities and pitfalls of an African identity in the late twentieth century.\" In the process he sheds new light on what it means to be an African-American, on the many preconceptions that have muddled discussions of race, Africa, and Afrocentrism since the end of the nineteenth century, and, in the end, to move beyond the idea of race. In My Father's House is especially wide-ranging, covering everything from Pan Africanism, to the works of early African-American intellectuals such as Alexander Crummell and W.E.B. Du Bois, to the ways in which African identity influences African literature. In his discussion of the latter subject, Appiah demonstrates how attempts to construct a uniquely African literature have ignored not only the inescapable influences that centuries of contact with the West have imposed, but also the multicultural nature of Africa itself. Emphasizing this last point is Appiah's eloquent title essay which offers a fitting finale to the volume. In a moving first-person account of his father's death and funeral in Ghana, Appiah offers a brilliant metaphor for the tension between Africa's aspirations to modernity and its desire to draw on its ancient cultural roots. During the Los Angeles riots, Rodney King appeared on television to make his now famous plea: \"People, can we all get along?\" In this beautiful, elegantly written volume, Appiah steers us along a path toward answering a question of the utmost importance to us all.","title":"In My Father's House: Africa in the Philosophy of Culture","type":"Book","uuidString":"B1556825-A31C-4589-952F-D56DF6DB790B"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51R3FoqlTVL.jpg","notes":"Traces the history of Delta Sigma Theta, a Black sorority and assesses its role helping Black professional women","title":"In Search of Sisterhood: Delta Sigma Theta and the Challenge of the Black Sorority Movement","type":"Book","uuidString":"1E362CEA-BF26-408A-9ECF-8FEE6DC434F4"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51oCt2xidIL.jpg","notes":"After hiding in her grandmother’s attic for seven years, Harriet Ann Jacobs was finally able to escape servitude—and her master’s sexual abuse—when she fled to the North. Once there, she became a very active abolitionist, and her correspondence with Harriet Beecher Stowe inspired her to write Incidents in the Life of a Slave Girl about her years as a slave.  She published the narrative in 1861 under the pseudonym Linda Brent, and the book was written as a novel with fictionalized characters to protect Jacobs from retribution by her former owners. (Dr. Flint, i.e., the real Dr. James Norcom, is Linda Brent’s master in the novel.) The story emphasized certain negative aspects of slavery—especially the struggles of female slaves under sexually abusive masters, cruel mistresses, and the sale of their children—in order to play on the sympathies of white middle-class women in the North.  Incidents in the Life of a Slave Girl was published at the beginning of the American Civil War. It contributed to the Union’s and abolitionists’ war effort, but is today seen as an important first-hand account from an escaped slave woman and an important abolitionist. After the Civil War, Jacobs continued to support the African-American cause, particularly education, until her death in 1897.  Skyhorse Publishing, along with our Arcade, Good Books, Sports Publishing, and Yucca imprints, is proud to publish a broad range of biographies, autobiographies, and memoirs. Our list includes biographies on well-known historical figures like Benjamin Franklin, Nelson Mandela, and Alexander Graham Bell, as well as villains from history, such as Heinrich Himmler, John Wayne Gacy, and O. J. Simpson. We have also published survivor stories of World War II, memoirs about overcoming adversity, first-hand tales of adventure, and much more. While not every title we publish becomes a New York Times bestseller or a national bestseller, we are committed to books on subjects that are sometimes overlooked and to authors whose work might not otherwise find a home.","title":"Incidents in the Life of a Slave Girl: An Autobiographical Account of an Escaped Slave and Abolitionist","type":"Book","uuidString":"E0BA01FE-B1A3-441C-95A2-7A08B4984721"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51%2B5Z%2BRgLvL.jpg","notes":"The first full length study of the history of sexuality in America, Intimate Matters offers trenchant insights into the sexual behavior of Americans, from colonial times to today. D'Emilio and Freedman give us a deeper understanding of how sexuality has dramatically influenced politics and culture throughout our history. ","title":"Intimate Matters: A History of Sexuality in America","type":"Book","uuidString":"65E1F821-2C6D-47DD-AF67-09087E6E7B40"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51eoAu%2BFNAL.jpg","notes":"A series of philosophical conversations between a man and a great ape ultimately ask the question, \"To whom does the earth belong? \"","title":"Ishmael","type":"Book","uuidString":"19D5E146-8014-4DA5-BB11-FD9829F2EB73"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/41iJBj%2BFjRL.jpg","notes":"Si vous le lisez avec l'espoir de trouver dans J'irai cracher sur vos tombes quelque chose capable de mettre vos sens en feu, vous allez drolement etre decu. ","title":"J'Irai Cracher Sur Vos Tombes","type":"Book","uuidString":"C123FB9F-1554-4B57-B36E-A4F9740569A0"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51kjzeV1mrL.jpg","notes":"You will find in this book, for the time, a complete step by step guidance to achieving spiritual perfection, and a successful life, based on the Kamitic (Ancient Egyptian) initiation system. Those student on those spiritual path will know, Where I am at in my spiritual growth? What is the next step and the next? \"How much progress am I making, and how do I know when to move on to the next level?\" ","title":"Metu Neter Vol. 2: Anuk Ausar, The Kamitic Initiation System","type":"Book","uuidString":"0F28D891-7F34-4775-B370-E6C80603AA1E"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51-4fHSY%2B7L.jpg","notes":"The first of two classic studies that examined the daily life of a typical small american city-in actuality, Muncie, Indiana-in the mid-1920s, using the approach of social anthropology. Of enduring interest to students of SOCIOLOGY (740), these works inspired an acclaimed six-part television series. Foreword by Clark Wissler.","title":"Middletown: A Study in Modern American Culture","type":"Book","uuidString":"DB815E2F-66B6-4A8B-BF19-80C3C5C3FB92"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/41VBC2FSZ1L.jpg","notes":"Using New York State's Hudson Valley as a backdrop, this book provides a regional perspective on black identity from the colonial period to the present. Through racialized struggles and varying experiences of black residents, a black presence in the region has persisted. Factors such as religious structures and cosmologies, ethnicity, legal systems, economic patterns, class, gender, family structures, and leaders have uniquely influenced black identity. The religion-inspired metamorphosis of celebrated antebellum black resident Isabella Van Wagenen, later known as Sojourner Truth, illustrates how the abandonment of her slave identity and her refusal to call her new employer \"master,\" was a liberation for blacks--a \"mighty change.\" Moving from the colonial period to the present, this book underscores the mighty change in the identity of blacks in the region over nearly a four-hundred-year period--from captive to slave, from slave to free, from northern-born to southern-influenced, from pre-industrial to post-industrial, from multi-ethnic to multi-national. Like Isabella, in her successful determination to reclaim her son who had been wrongfully forced into slavery, black people within the region have stood \"tall within.\"","title":"Mighty Change, Tall Within: Black Identity in the Hudson Valley","type":"Book","uuidString":"32E29C83-4F4B-4DDD-86ED-9A502B02D616"},{"notes":"Minorities and Media is a highly readable analysis of the ways in which the mass media have portrayed minorities in the United States since the late nineteenth century. The book examines the ways in which the media have reinforced racial stereotypes, and provides an analysis of current trends which reflect the growing recognition of ethnic diversity. The authors conclude that the increasing racial diversity of the United States and continued audience segmentation will reduce the role of communication media in transmitting and developing the common culture of American society.","title":"Minorities and Media: Diversity and the End of Mass Communication","type":"Book","uuidString":"40F73D80-BA4F-48A8-9D2C-CA93A02D67F0"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/518mz6Nt5NL.jpg","notes":"In the years after the end of the First World War, large numbers of Africans and African Americans emigrated to the cities of Europe in search of work and improved social conditions. Their impact on white European society was immense. In Paris, where the artistic climate was particularly sensitive and experimental, avant-garde artists courted black personalities such as Josephine Baker, Henry Crowder, and Langston Hughes for their sense of style, vitality, and \"otherness.\" Leger, Picasso, Brancusi, Man Ray, Giacometti, Sonia Delaunay, and others enthusiastically collected African sculptures and wore tribal jewelry and clothes. More importantly, they adopted black forms in their work, and their style soon influenced a larger audience anxious to be in vogue. A passion for black culture swept through Paris, and by the end of the 1920s, black forms that had provided the initial spark to the modernist vision had become the commercially successful Art Deco style. Negrophilia, from the French negrophilie--the contemporary term to describe the craze--examines this commingling of black and white cultures in jazz-age Paris. Painting, sculpture, photography, popular music, dance, theater, literature, journalism, furniture design, fashion, and advertising--all are scrutinized to show how black forms were appropriated, adapted, and popularized by white artists. The photographs, writings, and memorabilia of poet Guillaume Apollinaire, art collectors Paul Guillaume and Albert Barnes, shipping heiress and publisher Nancy Cunard, and Surrealists Michel Leiris and Georges Bataille help to recreate the contemporary atmosphere. The book raises questions about the avant-garde's motives, and suggests reasons and meaning for its interest. 115 b/w photographs and illustrations.","title":"Negrophilia: Avant-Garde Paris and Black Culture in the 1920s","type":"Book","uuidString":"F6EFFAD0-451A-41FE-9A31-16DD6081FE00"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/511M9VTwPML.jpg","notes":"King David never let anything stand in his way, as he clawed his way out of the mean streets. If it took busting an old lady’s head open with a Coke bottle for her last dollar, so be it. Mixing battery acid with cocaine to gain revenge was acceptable, too. Whatever it took. Then he made it big—only to find others had not forgotten, had no intention of forgiving. They came after him. He left behind a Cadillac and a diary, left it to a writer Donald Goines called “Paul Pawlowski.” Like all Goines’ novels, Never Die Alone is based on truth. ","title":"Never Die Alone","type":"Book","uuidString":"D6B6310E-5E55-4D2D-9506-205D18A6C807"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/61tx5f55LtL.jpg","notes":"No Sleep is a visual history of the halcyon days of New York City club life as told through flyer art. Spanning the late 80s through the late 90s, when nightlife buzz travelled via flyers and word of mouth, No Sleep features a collection of artwork from the personal archives of NYC DJs, promoters, club kids, nightlife impresarios, and the artists themselves. Club flyers, by design, were ephemeral objects distributed on street corners, outside of nightclubs and concert halls, in barbershops and retail shops, and were not intended to be preserved for posterity. Through the 90s, they became both increasingly prevalent and more sophisticated as printing technology evolved. Overnight, however, with the advent of the internet, the flyer essentially disappeared, despite it being common at one time for promoters to print thousands of flyers for any given event. Recently, these flyers have become sought-after collector's items.","title":"No Sleep: NYC Nightlife Flyers 1988-1999","type":"Book","uuidString":"985589E2-4CA0-4F24-821D-09B0AA29149B"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51XBnV0wAbL.jpg","notes":"McMurphy is a lusty, profane, life-loving fighter who rallies the other mental-hospital patients around him by challenging the dictatorship of Big Nurse. It soon becomes a grim struggle for the minds and hearts of the men.","title":"One Flew Over the Cuckoo's Nest","type":"Book","uuidString":"450677C5-1B3F-4BA1-9370-82C20E774BBF"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51l1yy6kSWL.jpg","notes":"Gay black men, a thriving subculture of the black and gay communities, are doubly marginalized. Along with other black men, they are typically portrayed in the media and literature as \"street corner men\"—unemployed drifters, absentee fathers, substance abusers. In the larger gay community, they are an invisible minority. One of the Children, the first formal cultural study of gay black men in Harlem, not only illuminates this segment of America's gay population but presents a far richer, more diverse portrait of black men's lives than is commonly perceived.  Based on two years' intensive research—during which the author lived in Harlem's gay community—including extensive interviews with fifty-seven community members, this book depicts gay black men's lives in all their social, economic, and cultural complexity. William Hawkeswood takes us from the street into the homes and lives of his subjects. He describes the elaborate network of friends, called \"family,\" that supports these men emotionally and financially, and the community's two-tiered economic structure, comprising gay men and \"boys,\" or hustlers.  Hawkeswood also explores what it means for these men to be both gay and black. In the process, he makes the surprising discovery that while the AIDS virus looms all around them, it has not yet significantly affected the community of gay blacks who choose their sexual partners exclusively from among Harlem's other gay black men.","title":"One of the Children: Gay Black Men in Harlem","type":"Book","uuidString":"52A220FD-6A20-4BF1-A220-6CA258196D10"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/41F7A08AKKL.jpg","notes":"Paris Noir fills a grievous gap in the fascinating history of American expatriates who chose to live in Paris in the twentieth century. Alongside Ernest Hemingway, Gertrude Stein, and Henry Miller was an avant-garde and tightly knit community of African Americans who found in Paris the artistic, racial, and emotional freedom denied them back home. The writers James Baldwin and Richard Wright; the jazz musicians Miles Davis, Charlie Parker, Sidney Bechet; and the artists Henry Ossawa Tanner, Lois Mailou Jones, and Jean-Michel Basquiat are among the score of exiles for whom Paris symbolized a color-blind society. Unlike their white compatriots, African Americans in Paris rejected not only American society, but also their victimized status in the U.S. And while black and white Americans inhabited different worlds even in Paris, they found meeting grounds in such places as Bricktop's jazzy nightclub, where the flamboyant owner taught Cole Porter to dance the Charleston. As the historian John Merriman proclaimed, \"With skill and passion, Stovall brings this vibrant community to life.\"","title":"Paris Noir: African Americans in the City of Light","type":"Book","uuidString":"F487AFBF-636C-4861-8A5E-32A2508A2970"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/41K1OYj4AuL.jpg","notes":"Long recognized as a masterpiece of modern American poetry, William Carlos Williams' Paterson is one man's testament and vision, \"a humanist manifesto enacted in five books, a grammar to help us live\" (Denis Donoghue).  Paterson is both a place―the New Jersey city in whom the person (the poet's own life) and the public (the history of the region) are combined. Originally four books (published individually between 1946 and 1951), the structure of Paterson (in Dr. Williams' words) \"follows the course of teh Passaic River\" from above the great falls to its entrance into the sea. The unexpected Book Five, published in 1958, affirms the triumphant life of the imagination, in spite of age and death. This revised edition has been meticulously re-edited by Christopher MacGowan, who has supplied a wealth of notes and explanatory material.","title":"Paterson","type":"Book","uuidString":"27872F86-1FF0-4090-84C8-87B2578DD112"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/61TAsQU9KSL.jpg","notes":"David Muir's \"Pieces of Jamaica\" collection captures the candid beauty of the Jamaican people and its rich and diverse landscape, as he unearths art in everyday life on \"The Real Rock.\" David's collection consists of photographs depicting moments of authentic Jamaican culture and a sampling of our true Jamaican spirit. \"Pieces of Jamaica\" captures rustic reality and spirited humanity along with true beauty in things others might consider mundane.  Couple David's innate ability to connect with people with his brand of photography, and what he has is a winning combination, which serves him well as a photographic artist.","title":"Pieces of Jamaica: The Real Rock Edition","type":"Book","uuidString":"A01D9647-43AE-4C7C-B629-E68BFCC0800F"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/31CAwhfOmiL.jpg","notes":"In the 16th century, the beginning of African enslavement in the Americas until the ratification of the Thirteenth Amendment and emancipation in 1865, Africans were hunted like animals, captured, sold, tortured, and raped. They experienced the worst kind of physical, emotional, psychological, and spiritual abuse. Given such history, isn’t it likely that many of the enslaved were severely traumatized? And did the trauma and the effects of such horrific abuse end with the abolition of slavery?  Emancipation was followed by one hundred more years of institutionalized subjugation through the enactment of Black Codes and Jim Crow laws, peonage, convict leasing, domestic terrorism and lynching. Today the violations continue, and when combined with the crimes of the past, they result in yet unmeasured injury. What do repeated traumas, endured generation after generation by a people produce? What impact have these ordeals had on African Americans today?  Dr. Joy DeGruy, answers these questions and more. With over thirty years of practical experience as a professional in the mental health field, Dr. DeGruy encourages African Americans to view their attitudes, assumptions, and behaviors through the lens of history and so gain a greater understanding of how centuries of slavery and oppression have impacted people of African descent in America.  Post Traumatic Slave Syndrome helps to lay the necessary foundation to ensure the well-being and sustained health of future generations and provides a rare glimpse into the evolution of society’s beliefs, feelings, attitudes and behavior concerning race in America.","title":"Post Traumatic Slave Syndrome: America's Legacy of Enduring Injury and Healing by Joy DeGruy Leary","type":"Book","uuidString":"0CA84178-5A19-42B2-BC74-0437B9F46926"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51B8PWEJZ4L.jpg","notes":"What did it mean to be queer and Asian American at the turn of the century? This volume considers how Asian American racial and queer sexuality interconnect in mutually shaping and complicating ways.","title":"Q &amp; A: Queer in Asian America","type":"Book","uuidString":"A62910B5-3796-4B50-8AC2-634C706074B0"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/418BV48GHCL.jpg","notes":"Cultural Studies. Gay and Lesbian Studies. Urban Planning. Exploring the interactions between queer identity, experience, and activism and a range of communal and public spaces, QUEERS IN SPACE: COMMUNITIES, PUBLIC PLACES, SITES OF RESISTANCE opens up a new direction in gay and lesbian studies. From gay space in Mexico City to the now legendary baths of New York and San Francisco, QUEERS IN SPACE travels to bars, parks, beaches, neighborhoods, and cities to follow the expansion and transformation of queer communities beyond the gay ghetto. By focusing on the geography of queer social relationships QUEERS IN SPACE raises critical and timely questions about the role of social space in shaping identities, the meaning of communal space for marginalized peoples, and the significance of public spaces for social visibility. Edited by Gordon Brent Ingram, Anne-Marie Bouthillette, and Yolanda Retter.","title":"Queers in Space: Communities, Public Places, Sites of Resistance","type":"Book","uuidString":"E30E3B2B-99CA-4864-9155-E6A89C60551F"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/61%2BCteuf1BL.jpg","notes":"Artist and veteran Pixar animator Sanjay Patel lends a lush, whimsical illustration style and lighthearted voice to one of Hindu mythology's best-loved and most enduring tales. Teeming with powerful deities, love-struck monsters, flying monkey gods, magic weapons, demon armies, and divine love, Ramayana tells the story of Rama, a god-turned-prince, and his quest to rescue his wife Sita after she is kidnapped by a demon king. This illustrated tale features over 100 colorful full-spread illustrations, a detailed pictorial glossary of the cast of characters who make up the epic tale, and sketches of the work in progress. From princesses in peril to gripping battles, scheming royals, and hordes of bloodthirsty demons, Ramayana is the ultimate adventure story presented with an unforgettably modern touch.  ","title":"Ramayana: Divine Loophole","type":"Book","uuidString":"72C784C3-355A-4141-9D2F-715380926D02"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51SneapTLZL.jpg","notes":"This book is a collection of essays written during the 1980s and 1990s, generated as parts of other, larger activist efforts going on at the time. Read together, the essays trace the progress of the conversations between different activist groups, and between the authors of the pieces, Lisa Duggan and Nan Hunter, creating a bridge between feminists, gay activists, those in politics, and those in the law.  Since the 1995 publication of Sex Wars, the political landscape has altered significantly. Yet the issues (and essays) are still relevant today. The anniversary edition contains a new chapter dealing with the changes in the law since the book's publication (Lawrence v. Texas, for example).","title":"Sex Wars: Sexual Dissent and Political Culture","type":"Book","uuidString":"29CFBA97-379E-4AC5-A938-7A5E7566DC31"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51dl7vqjKEL.jpg","notes":"In the novel, Siddhartha, a young man, leaves his family for a contemplative life, then, restless, discards it for one of the flesh. He conceives a son, but bored and sickened by lust and greed, moves on again. Near despair, Siddhartha comes to a river where he hears a unique sound. This sound signals the true beginning of his life -- the beginning of suffering, rejection, peace, and, finally, wisdom.","title":"Siddhartha","type":"Book","uuidString":"C8FECCF6-CBF9-45D1-85E4-C4706E8A8660"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51J80C1E1cL.jpg","notes":"In this delicately wrought and profoundly moving, multi-award winning novel, Andrea Levy handles the weighty themes of empire, prejudice, war and love, with a lightness of touch and a generosity of spirit that challenges and uplifts the reader.","title":"Small Island","type":"Book","uuidString":"412925C5-1043-4FA8-BE98-9FD23A83C551"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/5112TK1X2DL.jpg","notes":"Whether it's Adidas, New Balance or Puma, sneakers are the defining footwear of the modern age. With over 300 styles photographed in color beginning with the legendary Converse All Star, Sneakers pays tribute to this most versatile of shoes, from collectors' items to everyday street wear in cutting-edge subcultures, from the aerodynamic Nike models on the running track, to the one-of-a kind Gucci or Donna Karan on the runway. In-depth feature spreads explore such subjects as brand identity, celebrity endorsements, famous advertising campaigns, and advice for collectors.","title":"Sneakers","type":"Book","uuidString":"D502B12B-7E90-48AF-A0C7-B326FF003857"},{"notes":"The great medieval city of Fex is the fountainhead of native resistance to French rule in Morocco today. In this strange and disturbing place lives the boy, Amar, sone of a Moslem holy man. working for a potter, he gets into a fight with another youth and, wile running away, finding himself in an orchard owned by Moulay Ali. There begins his personal entanglement in the violence which is about to erupt all over Morocco.... Amar becomes involved with people who are involved in a moral struggle set against a fiery background of political scheming and untimately, undeclared war...","title":"Spiders House 1ed","type":"Book","uuidString":"14AFF60D-6D37-4BB0-8163-30FEA880D2EE"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/3167%2Bq4lCnL.jpg","notes":"Style: The Basics of Clarity and Grace reflects the wisdom and clear authorial voice of Williams’ best-selling book, Style: Lessons in Clarity and Grace, while streamlining every chapter to create a very brief, yet powerfully direct guide to writing with style.","title":"Style: Ten Lessons in Clarity &amp; Grace","type":"Book","uuidString":"B1233E7A-33AB-4CF7-9898-77814A632398"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51K977D249L.jpg","notes":"Harlem Mecca is an indispensable aid toward gaining a better understanding of the Harlem Renaissance.The contributors to this edition include W.E.B Du Bois, Arthur Schomburg, James Weldon Johnson, Langston Hughes, and Countee Cullen.","title":"Survey Graphic the March 1925 Number Harlem Mecca of the New Negro","type":"Book","uuidString":"76E17BDF-9CC5-4B3D-8B48-8BA9626708B2"},{"coverImageLargeURLString":"https://www.google.com/url?sa=i&amp;rct=j&amp;q=&amp;esrc=s&amp;source=images&amp;cd=&amp;ved=0ahUKEwiahcmZqOvUAhUC8z4KHZOWBTAQjRwIBw&amp;url=http%3A%2F%2Fwww.goodreads.com%2Fbook%2Fshow%2F258675.Swamp_Man&amp;psig=AFQjCNFK1-84R7LBWxoBDsXZl7Au085MHA&amp;ust=1499109494284867&amp;cad=rja","notes":"George Jackson was a “Swamp Man,” born and bred in the dark watery woods of Mississippi. He was a gentle young man who turned as deadly as a water moccasin after he saw what the four hill boys did to his sister. They caught her soon after she got off the bus, home for her first year of college. When they were through with her, she let her mind shut down, fearing to remember. Slipping through the swamps like a ghost, George stalked them, one by one, two by two… ","title":"Swamp Man","type":"Book","uuidString":"A6E1928A-3079-415A-8E06-48939B24E73E"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/41B-kKct4NL.jpg","notes":"This book takes the process of \"reading the body\" into the fields at the forefront of culture—the vast spaces mapped by science and technology—to show that the body in high-tech is as gendered as ever. From female body building to virtual reality, from cosmetic surgery to cyberpunk, from reproductive medicine to public health policies to TV science programs, Anne Balsamo articulates the key issues concerning the status of the body for feminist cultural studies in a postmodern world. Technologies of the Gendered Body combines close readings of popular texts—such as Margaret Atwood’s novel The Handmaid’s Tale, the movie Pumping Iron II: The Women, cyberpunk magazines, and mass media—with analyses of medical literature, public policy documents, and specific technological practices. Balsamo describes the ways in which certain biotechnologies are ideologically shaped by gender considerations and other beliefs about race, physical abilities, and economic and legal status. She presents a view of the conceptual system that structures individuals’ access to and participation in these technologies, as well as an overview of individuals’ rights and responsibilities in this sometimes baffling area. Examining the ways in which the body is gendered in its interactions with new technologies of corporeality, Technologies of the Gendered Body counters the claim that in our scientific culture the material body has become obsolete. With ample evidence that the techno-body is always gendered and marked by race, this book sets the stage for a renewed feminist engagement with contemporary technological narratives.","title":"Technologies of the Gendered Body: Reading Cyborg Women","type":"Book","uuidString":"A3BE87F4-DDEE-452D-9B04-7F118486A671"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/41ILsjEMw-L.jpg","notes":"Amoral, cunning, ruthless, and instructive, this New York Times bestseller is the definitive manual for anyone interested in gaining, observing, or defending against ultimate control.    In the book that People magazine proclaimed “beguiling” and “fascinating,” Robert Greene and Joost Elffers have distilled three thousand years of the history of power into 48 essential laws by drawing from the philosophies of Machiavelli, Sun Tzu, and Carl Von Clausewitz and also from the lives of figures ranging from Henry Kissinger to P.T. Barnum.   Some laws teach the need for prudence (“Law 1: Never Outshine the Master”), others teach the value of confidence (“Law 28: Enter Action with Boldness”), and many recommend absolute self-preservation (“Law 15: Crush Your Enemy Totally”). Every law, though, has one thing in common: an interest in total domination. In a bold and arresting two-color package, The 48 Laws of Power is ideal whether your aim is conquest, self-defense, or simply to understand the rules of the game.","title":"The 48 Laws of Power","type":"Book","uuidString":"42381F53-060C-4790-99A4-A3F268B71D46"},{"coverImageLargeURLString":"https://www.google.com/url?sa=i&amp;rct=j&amp;q=&amp;esrc=s&amp;source=images&amp;cd=&amp;ved=0ahUKEwi-5cSSv-vUAhUCVj4KHc0XBIUQjRwIBw&amp;url=https%3A%2F%2Fpeelslowlynsee.wordpress.com%2Ftag%2Fthe-amityville-horror%2F&amp;psig=AFQjCNHhAvAdxB7LLQAcq3KbT7dl1vWq6Q&amp;ust=1499115651905816","notes":"The Amityville Horror is a book by American author Jay Anson, published in September 1977. It is also the basis of a series of films released from 1979 onwards. The book is claimed to be based on the paranormal experiences of the Lutz family, but has led to controversy and lawsuits over its truthfulness. ","title":"The Amityville Horror","type":"Book","uuidString":"B3CC106B-39EA-40D1-BB45-4D671B950D2A"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/517P6KRXG3L.jpg","notes":"One of the nation's most unique artistic voices finds expression in this fascinating retrospective of his work, illuminating his groundbreaking work in collages, photastats, watercolors, gouaches, and oils, including examples of his lesser-known landscape painting, sculpture, costume designs, and much, much more. 17,500 first printing. ","title":"The Art of Romare Bearden","type":"Book","uuidString":"87588CF3-28A9-42E0-B997-184C43C921E4"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/41tacJM9q0L.jpg","notes":"Since the 1990s, young Asian Americans including Doo-Ri Chung, Derek Lam, Thakoon Panichgul, Alexander Wang, and Jason Wu have emerged as leading fashion designers. They have won prestigious awards, been chosen to head major clothing labels, and had their designs featured in Vogue, Harper’s Bazaar, and other fashion magazines. At the same time that these designers were rising to prominence, the fashion world was embracing Asian chic. During the 1990s, “Asian” shapes, fabrics, iconography, and colors filled couture runways and mass-market clothing racks. In The Beautiful Generation, Thuy Linh Nguyen Tu explores the role of Asian American designers in New York’s fashion industry, paying particular attention to how they relate to the garment workers who produce their goods and to Asianness as a fashionable commodity. She draws on conversations with design students, fashion curators, and fashion publicists; interviews with nearly thirty Asian American designers who have their own labels; and time spent with those designers in their shops and studios, on their factory visits, and at their fashion shows. The Beautiful Generation links the rise of Asian American designers to historical patterns of immigration, racial formation, and globalized labor, and to familial and family-like connections between designers and garment workers.","title":"The Beautiful Generation: Asian Americans and the Cultural Economy of Fashion","type":"Book","uuidString":"0FC44600-4BE3-4E10-9154-5492B8D352FC"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/41tpBJUYuHL.jpg","notes":"Holden, knowing he is to be expelled from school, decides to leave early. He spends three days in New York City and tells the story of what he did and suffered there.","title":"The Catcher in the Rye","type":"Book","uuidString":"BD708613-0170-437E-9CD5-FA91E2134C70"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51ZDKYQPsDL.jpg","notes":"Sennett's study of urban culture began with a discourse on public and private life, The Fall of Public Man ( LJ 12/15/76), and continued with the historical novel, Palais Royal ( LJ 12/86). This, the final installment of his loose \"trilogy,\" seeks to relate architecture, urban planning, and sculpture to the cultural life of cities, from the time of ancient Athens to late 20th-century New York. The author achieves a great deal more, for he offers a broad humanistic reflection on many of the elements that constitute modern culture: literature, spiritual rootlessness, philosophy, music, poetry, ballet, bars, and public baths. The central thesis, that modern humans suffer because of the dichotomy between their subjective private experience and their outside public life, is thoroughly persuasive. Almost every page of this elegantly written work of cultural history contains food for thought, e.g., \"The essence of developing as a human being is developing the capacity for ever more complex experience.\" For general collections. ","title":"The Conscience of the Eye: The Design and Social Life of Cities","type":"Book","uuidString":"035AF333-3834-4ECE-AE47-C23F89C577D1"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51F1Q8Z4N0L.jpg","notes":"\"Rich's poems do not demand the willing suspension of disbelief. They demand belief, and it is a measure of her success as a poet that most of the time they get it. . . . The affirmation and the occasional moments of pure joy in these poems are quiet but fully earned.\"--Margaret Atwood, New York Times Book Review","title":"The Dream of a Common Language: Poems 1974-1977","type":"Book","uuidString":"82CE9423-7424-4DD4-9EF3-893E0AF3FC96"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/317P%2BYERD0L.jpg","notes":"The writer, in a dream, boards a bus on a drizzly afternoon and embarks on a incredible voyage through Heaven and Hell. He meets a host of supernatural beings far removed from his expectations and comes to significant realizations about the ultimate consequences of everyday behavior. This is the starting point for a profound meditation upon good and evil. \"If we insist on keeping Hell (or even earth) we shall not see Heaven: if we accept Heaven we shall not be able to retain even the smallest and most intimate souvenirs of Hell.","title":"The Great Divorce - A Dream","type":"Book","uuidString":"3CACA0F0-1707-481F-932A-375417F5F299"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51lw%2BKghfxL.jpg","notes":"In The Heart of a Woman, Maya Angelou leaves California with her son, Guy, to move to New York. There she enters the society and world of black artists and writers, reads her work at the Harlem Writers Guild, and begins to take part in the struggle of black Americans for their rightful place in the world. In the meantime, her personal life takes an unexpected turn. She leaves the bail bondsman she was intending to marry after falling in love with a South African freedom fighter, travels with him to London and Cairo, where she discovers new opportunities.  The Heart of a Woman is filled with unforgettable vignettes of such renowned people as Billie Holiday and Malcom X, but perhaps most importantly chronicles the joys and the burdens of a black mother in America and how the son she has cherished so intensely and worked for so devotedly finally grows to be a man.","title":"The Heart of a Woman","type":"Book","uuidString":"E68D1159-C47E-4362-AC72-5E34AC867AB6"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/61V8yBmfTgL.jpg","notes":"Few teachers in the West possess both the spiritual training and the scholarship to lead us along the path to enlightenment. Robert Thurman is one such teacher. Now, in his first experiential course on the essentials of Tibetan Buddhism, adapted and expanded from a popular retreat he led, Thurman -- the first Westerner ordained by His Holiness the Dalai Lama himself -- shares the centuries-old wisdom of a highly valued method of insight used by the great Tibetan masters.  ","title":"The Jewel Tree of Tibet: The Enlightenment Engine of Tibetan Buddhism","type":"Book","uuidString":"4D732974-D023-4C25-B793-27EE36E870DF"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/21wo2NiCHwL.jpg","notes":"The Kybalion: Hermetic Philosophy is a 1908 book claiming to be the essence of the teachings of Hermes Trismegistus, published anonymously by a group or person under the pseudonym of \"the Three Initiates\". The Kybalion was first published in 1908 by the Yogi Publication Society and is now in the public domain, as well as circulating the World Wide Web. Purportedly based upon ancient Hermeticism, its philosophies, in conjunction with others, have become founding pillars within the New Thought movement of the early 1910s. The book early on makes the claim that it makes its appearance in one's life when the time is appropriate and includes axioms and insights similar to those found in the Book of Proverbs. The \"Three Initiates\" who authored The Kybalion chose to remain anonymous. As a result, a great deal of speculation has been made about who actually wrote the book. The most common proposal is that The Kybalion was authored by William Walker Atkinson, either alone or with others, such as Paul Foster Case and Elias Gewurz.","title":"The Kybalion: Hermetic Philosophy","type":"Book","uuidString":"DEA94890-84E2-4AAB-85D6-D571B6DB3082"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/41KyX9YsgxL.jpg","notes":"From the author of Frankenstein comes this apocalyptic tale of a world devastated by plague. Mary Shelley's 1826 roman à clef takes place in the late twenty-first century, as England's last king abdicates and a charmed circle of idealistic political reformers plunges into a maelstrom of war, pestilence, and anarchy.  ","title":"The Last Man","type":"Book","uuidString":"F445F6FD-FDD7-46BB-86E2-EC1D9D96B025"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/412bD8GisgL.jpg","notes":"The Marrow of Tradition. The Marrow of Tradition (1901) is a historical novel by the African-American author Charles W. Chesnutt, set at the time and portraying a fictional account of the Wilmington Insurrection of 1898 in Wilmington, North Carolina.","title":"The Marrow of Tradition: African American Realist Fiction","type":"Book","uuidString":"F77119C0-3969-453D-A624-631BB0CFB094"},{"coverImageLargeURLString":"https://www.google.com/url?sa=i&amp;rct=j&amp;q=&amp;esrc=s&amp;source=images&amp;cd=&amp;ved=0ahUKEwiFjsy_vevUAhXCND4KHe03B_4QjRwIBw&amp;url=https%3A%2F%2Fwww.amazon.com%2FMajor-American-Poets-Mentor-Book%2Fdp%2F0451604369&amp;psig=AFQjCNHgbFuWwQVYeur1ui9MCP9cHq2-bg&amp;ust=1499115209725933","notes":"The voice of the nation rings out loud and clear in this unique anthology of great American poetry.   Editors Oscar Williams and Edwin Honig concentrate on the work of 20 major American poets. They include sizable selections from the poetry of:  • Wallace Stevens • Ralph Waldo Emerson • William Carlos Williams • Henry Wadsworth • Ezra Pound • Walt Whitman • Edgar Allen Poe • Emily Dickinson • Edna St. Vincent Millay • Stephen Crane • e. e. cummings • Robert Frost • Hart Crane • W. H. Auden • And more...","title":"The Mentor Book of Major American Poets","type":"Book","uuidString":"A9D0BDAC-1265-4CEA-9A68-60B20CF504A3"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51OXH990XDL.jpg","notes":"Provides brief reviews of hundreds of albums by new wave bands from Adam Ant to the Zantees","title":"The New Trouser Press Record Guide","type":"Book","uuidString":"A58D371A-B10E-4408-9FC2-D98317676060"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51fQ6R689hL.jpg","notes":"When Amos Tutuola's first novel, The Palm-Wine Drinkard, appeared in 1952, it aroused exceptional worldwide interest. Drawing on the West African Yoruba oral folktale tradition, Tutuola described the odyssey of a devoted palm-wine drinker through a nightmare of fantastic adventure. Since then, The Palm-Wine Drinkard has been translated into more than 15 languages and has come to be regarded as a masterwork of one of Africa's most influential writers. Tutuola's second novel, My Life in the Bush of Ghosts, recounts the fate of mortals who stray into the world of ghosts, the heart of the tropical forest. Here, as every hunter and traveler knows, mortals venture at great peril, and it is here that a small boy is left alone.","title":"The Palm-Wine Drinkard and My Life in the Bush of Ghosts","type":"Book","uuidString":"08C70120-D241-4F81-AD56-B15A07D95B23"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51l39CRxQKL.jpg","notes":"The Story of the Jamaican People is the first general history of Jamaica to be written in almost 40 years. It differs significantly from earlier \"imperial\" histories which have been written from the perspective of the coloniser and which have relegated Jamaicans to an inferior and passive role. In this book, the authors offer a new interpretation of Jamaica's history. The central theme is the long struggle of the African-Jamaican against subjugation, injustice, economic deprivation and the fight for full freedom. Sherlock and Bennett recount the epic resistance to slavery; from the acts of sabotage on the estates, the legendary exploits of Maroon heroes Cudjoe, Nanny and Tacky, to the final blow delivered by Sam Sharpe which ended slavery in Jamaica. An underlying theme throughout the book is the centrality of Africa, the original homeland of the African-Jamaican. The memory of Africa's ancient civilisations, its diverse tribes, languages, cultures and religions, sustained the African-Jamaican throughout slavery and remains a positive influence on modern-day Jamaican culture. Although the focus of the story is on African-Jamaican, the authors recognise the significant role played by other ethnic groups - East Indians, Chinese, Lebanese, Syrians and Jews - in the development of modern Jamaica. The Story of the Jamaican People is told in a powerfully evocative and poetic style in which the images of creative writers and artists are blended with extensive quotations from anthropological, sociological and historical sources. The book is copiously illustrated and has an extensive bibliographical and reference section as well as a useful index.","title":"The Story of the Jamaican People","type":"Book","uuidString":"10F320CB-A77A-4AFB-B9CA-C9B9F060B1F9"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/41Z3L-yNFGL.jpg","notes":"Charting the intersection of technology and ideology, cultural production and social science, Fatimah Tobing Rony explores early-twentieth-century representations of non-Western indigenous peoples in films ranging from the documentary to the spectacular to the scientific. Turning the gaze of the ethnographic camera back onto itself, bringing the perspective of a third eye to bear on the invention of the primitive other, Rony reveals the collaboration of anthropology and popular culture in Western constructions of race, gender, nation, and empire. Her work demonstrates the significance of these constructions—and, more generally, of ethnographic cinema—for understanding issues of identity. ","title":"The Third Eye: Race, Cinema, and Ethnographic Spectacle","type":"Book","uuidString":"5B31B578-BBB4-450D-8010-DAAD3D6BAAA3"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/219rZr8iAxL.jpg","notes":"This special issue of GLQ: A Journal of Lesbian and Gay Studies presents essays that each adopt a methodologically distinctive analysis of a particular concern in transgender studies. Taken together, these pieces demonstrate the wide-ranging and sometimes antagonistic viewpoints of scholars and activists pursuing different political and intellectual goals. ","title":"The Transgender Issue","type":"Book","uuidString":"4B44733D-089F-4917-913D-6B49D0FC00BF"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/41qT%2BzCItZL.jpg","notes":"Among the oldest of Indias spiritual texts, the Upanishads are records of intensive question-and-answer sessions given by illumined sages to their students  in ashrams, at family gatherings, in a royal court, and in the kingdom of Death. The sages share flashes of insight, extraordinary visions, the results of their investigation into consciousness itself.  The Upanishads have puzzled and inspired wisdom seekers from Yeats to Schopenhauer. In this best-selling translation, Eknath Easwaran makes these challenging texts more accessible by selecting the passages most relevant to readers seeking timeless truths today. This book includes an overview of the cultural and historical setting, with chapter introductions, notes, and a Sanskrit glossary. But it is Easwarans understanding of the wisdom of the Upanishads that makes this edition truly outstanding.  Each sage, each Upanishad, appeals in a different way to the readers head and heart. For Easwaran, the Upanishads are part of Indias precious legacy, not just to Hinduism but to humanity, and in that spirit they are offered here.","title":"The Upanishads","type":"Book","uuidString":"943EF49C-207D-4196-84AC-DC30F5A51A02"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/517XPE52G4L.jpg","notes":"Set in Philadelphia some 60 years ago, There Is Confusion traces the lives of Joanna Mitchell and Peter Bye, whose families must come to terms with an inheritance of prejudice and discrimination as they struggle for legitimacy and respect.","title":"There Is Confusion","type":"Book","uuidString":"8E5DF51E-2905-45EE-834B-12BAFE831C0A"},{"coverImageLargeURLString":"http://images.gr-assets.com/books/1320542246l/822185.jpg","notes":"First published in 1937, this is the end product of two decades of research conducted by Napoleon Hill. His research started when Andrew Carnegie (the steel tycoon who was then the richest man on earth) gave him the assignment of organizing a Philosophy of Personal Achievement. Hill, who was a poor journalist, armed with just an introductory letter from Carnegie, set out to interview over five hundred successful people including Henry Ford, Thomas Edison, Alexander Graham Bell, John D. Rockefeller, George Eastman, William Wrigley Jr. and Charles M. Schwab. Hill then revealed the priceless wisdom of his research in the form of the thirteen steps to success (in Think and Grow Rich) and the seventeen principles of success (in courses and lectures he conducted). The concepts taught by Napoleon Hill transformed my life. Some of these include developing a definite purpose, building a Positive Mental Attitude (PMA), channeling the power of the sub-conscious mind and dealing with adversity. Everything he wrote about or talked about is thought provoking. He was wise, humble and funny. His philosophy is universal; he did not mix it with religion. The riches he referred to were more than money, for the Philosophy of Personal Achievement can be applied to anything in life. Hill was well ahead of his time. This book has a chapter dedicated to some of today's most important issues - Specialized Knowledge, Decision Making, Imagination and Organized Planning (in which he deals with Leadership). He also has principles for Teamwork","title":"Think and Grow Rich","type":"Book","uuidString":"4A77BB2E-9C58-4B5C-80E0-A25D24984BBC"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51g3d3qpFAL.jpg","notes":"Soon to be an HBO series, book three in the New York Times bestselling Neapolitan quartet about two friends in post-war Italy is a rich, intense, and generous-hearted epic by one of today's most beloved and acclaimed writers, Elena Ferrante, “one of the great novelists of our time.” (Roxana Robinson, The New York Times)","title":"Those Who Leave and Those Who Stay: Neapolitan Novels, Book Three","type":"Book","uuidString":"D1E6EC9F-15AC-4CB1-9A4A-EDC068517F53"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/41hOS-R0%2BpL.jpg","notes":"In this dramatic and compelling narrative, anthropologist Don Kulick follows the lives of a group of transgendered prostitutes (called travestis in Portuguese) in the Brazilian city Salvador. Travestis are males who, often beginning at ages as young as ten, adopt female names, clothing styles, hairstyles, and linguistic pronouns. More dramatically, they ingest massive doses of female hormones and inject up to twenty liters of industrial silicone into their bodies to create breasts, wide hips, and large thighs and buttocks. Despite such irreversible physiological changes, virtually no travesti identifies herself as a woman. Moreover, travestis regard any male who does so as mentally disturbed.  Kulick analyzes the various ways travestis modify their bodies, explores the motivations that lead them to choose this particular gendered identity, and examines the complex relationships that they maintain with one another, their boyfriends, and their families. Kulick also looks at how travestis earn their living through prostitution and discusses the reasons prostitution, for most travestis, is a positive and affirmative experience.  Arguing that transgenderism never occurs in a \"natural\" or arbitrary form, Kulick shows how it is created in specific social contexts and assumes specific social forms. Furthermore, Kulick suggests that travestis—far from deviating from normative gendered expectations—may in fact distill and perfect the messages that give meaning to gender throughout Brazilian society and possibly throughout much of Latin America.  Through Kulick's engaging voice and sharp analysis, this elegantly rendered account is not only a landmark study in its discipline but also a fascinating read for anyone interested in sexuality and gender.","title":"Travesti: Sex, Gender, and Culture among Brazilian Transgendered Prostitutes","type":"Book","uuidString":"C5618560-6C61-4C34-8C78-F70BFDA4B444"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/41OeEmRy68L.jpg","notes":"Set in Naples, Italy, this debut novel by New York Times bestselling author Elena Ferrante (My Brilliant Friend, The Days of Abandonment) tells a story about mothers and daughters and the complicated knot of lies, emotions, and shared history than binds them.  Following her mother's untimely and mysterious death, Delia embarks on a voyage of discovery through the chaotic, suffocating streets of her native Naples in search of the truth about her family. A series of mysterious telephone calls leads her to compelling and disturbing revelations about her mother's final days.  As the New York Times wrote about this novel, \"the raging, torrential voice of the author is something rare.\" Troubling Love is indeed a rare look into the abiding preoccupations and obsessions that bring millions of readers all over the world to her fiction. ","title":"Troubling Love","type":"Book","uuidString":"21F8849D-367C-4520-99E8-FB2E77592271"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/5118ZC1DYTL.jpg","notes":"Mr. Wright has much of merit to say about psychology of the world's darker peoples. Awareness of this psychology on the part of Western diplomats and newspapermen should make for the reporting of less nonsense than has been true in the past. Recommended for public, college and university. --This text refers to an out of print or unavailable edition of this title.","title":"White Man, Listen!","type":"Book","uuidString":"7A548821-4395-42AC-BF7E-2F0369BC9070"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/51CQpCUcvAL.jpg","notes":"Maya Angelou, one of the best-loved authors of our time, shares the wisdom of a remarkable life in this best-selling spiritual classic. This is Maya Angelou talking from the heart, down to earth and real, but also inspiring. This is a book to treasured, a book about being in all ways a woman, about living well, about the power of the word, and about the power do spirituality to move and shape your life. Passionate, lively, and lyrical, Maya Angelou's latest unforgettable work offers a gem of truth on every page.","title":"Wouldn't Take Nothing for My Journey Now","type":"Book","uuidString":"9532F4EA-D948-42E7-A227-22AF2802679A"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/41PlwLzhkfL.jpg","notes":"Published: 26th NOVEMBER Grandmaster Caz is a pioneering legend who can genuinely be credited as one of the inventors of rap. Caz is perhaps best known as the writer of Big Bang Hank's rhyme in Rappers Delight. The lyrics were stolen from him and he has never been credited or paid a dollar for writing the words to possibly the most famous rap record ever. Caz went on to form the legendary Coldcrush Brothers whose party rocking style would greatly influence many of rap's commercial breakthrough artists. In 2012 Caz became the unexpected star of Ice-T's seminal rap movie Something From Nothing : The Art Of Rap. In the movie Caz receives props from many of the cast, including Ice-T, Rev Run, Rakim and Eminem, who sight him as one of the godfathers of Rap. As a result of the movie Caz's career is enjoying a significant renaissance. Notable for his extraordinary penmanship Caz's favourite rhymes are reproduced from his notebooks and published for the first time in this beautiful book.","title":"Written! the Lyrics of Grandmaster Caz","type":"Book","uuidString":"D082128B-D263-4478-9C13-F5160A6F5E45"},{"coverImageLargeURLString":"https://images-na.ssl-images-amazon.com/images/I/71WQGDX9YYL.gif","notes":"Examines how scholars, activists, policy makers, and displaced working people have made sense of the contemporary ghetto","title":"Yo' Mama's Disfunktional","type":"Book","uuidString":"D01D9C3F-359A-4EA9-A4BE-B6F9D1493E3E"}]